# IsRecess Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCOpeningData..::..IsRecess Property
IFCOpeningData Class See Also
---
Trus if it is a recess, false if it is an opening.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsRecess { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRecess As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRecess {
	bool get ();
}
```

# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace